# Import Pandas and Numpy Library

## Chipotle Dataset

## Import the Chipotle dataset

In [ ]:
# the file is tab seperated
location = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv'
data =

# Check the first 10 enteries

# Check the last 10 enteries

# Find out the total number of observation in the dataset

# Find out the total number of variable in the dataset

# Print out names of all the columns

# How is the dataset indexed ?

# Which was the most ordered item? How many items were ordered for that item?

# What was the most ordered item in the choice_description column?

# Turn the item price into a float

# How much was the revenue for the period in the dataset?

# How many orders were made in the period?

# What is the average quantity and amount per order?

# Create a dataframe for all the items having price greater than 10 dollars. How many total observations are there

# What is the price of each item?

# What was the quantity of the most expensive item ordered?

# How many times were a Veggie Salad Bowl ordered?

# How many times people orderd more than one Canned Soda?

# Load the occupation data

In [ ]:
# the file is pipe seperated, also use user_id column as the index
location = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'

# See the first 25 entries

# What is the data type of each column?

# How many different occupations there are in this dataset?

# What is the most frequent occupation?

# Summarize the DataFrame

# Summarize all the columns

# Summarize only the occupation column

# Discover the Male ratio per occupation and sort it from the most to the least

# For each occupation, calculate the minimum and maximum ages

# For each occupation present the percentage of women and men

# What is the mean age of users?

# What is the age with least occurrence?

# Load the Euro Cup 12 Data

In [ ]:
euro12 = pd.read_csv('https://raw.githubusercontent.com/jokecamp/FootballData/master/Euro%202012/Euro%202012%20stats%20TEAM.csv')
euro12.head()

# How many team participated in the Euro2012?

# View only the columns Team, Yellow Cards and Red Cards and assign them to a dataframe called discipline

# Sort the teams by Red Cards, then to Yellow Cards (discipline)

# Filter teams that scored more than 6 goals

# Select the teams that start with G

# Present only the Shooting Accuracy from England, Italy and Russia

# Load the drinks data

In [ ]:
# Load the drinks data
address_drinks = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv'
drinks = pd.read_csv(address_drinks)
drinks.head()

# Which continent drinks more beer on average?

# For each continent print the statistics for wine consumption

# Print the mean alcoohol consumption per continent for every column

# Print the mean, min and max values for spirit consumption

# Create a new dataset

In [67]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

In [68]:
regiment = pd.DataFrame(raw_data, columns = raw_data.keys())
regiment

      regiment company      name  preTestScore  postTestScore
0   Nighthawks     1st    Miller             4             25
1   Nighthawks     1st  Jacobson            24             94
2   Nighthawks     2nd       Ali            31             57
3   Nighthawks     2nd    Milner             2             62
4     Dragoons     1st     Cooze             3             70
5     Dragoons     1st     Jacon             4             25
6     Dragoons     2nd    Ryaner            24             94
7     Dragoons     2nd      Sone            31             57
8       Scouts     1st     Sloan             2             62
9       Scouts     1st     Piger             3             70
10      Scouts     2nd     Riani             2             62
11      Scouts     2nd       Ali             3             70

 # What is the mean preTestScore from the regiment Nighthawks?

# Iterate over a group and print the name and the whole data from the regiment

# Load Alcohol Consumption Data

In [5]:
# Download the data from the folder
df = pd.read_csv("student-mat.csv")
df.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,...,4,3,4,1,1,3,6,5,6,6
1,GP,F,17,U,GT3,T,1,1,at_home,other,...,5,3,3,1,1,3,4,5,5,6
2,GP,F,15,U,LE3,T,1,1,at_home,other,...,4,3,2,2,3,3,10,7,8,10
3,GP,F,15,U,GT3,T,4,2,health,services,...,3,2,2,1,1,5,2,15,14,15
4,GP,F,16,U,GT3,T,3,3,other,other,...,4,3,2,1,2,5,4,6,10,10

# captalize Mjob and Fjob

# Create a function called majority that return a boolean value to a new column called legal_drinker

# Select Medu, Fedu, freetime, goout columns and create a new dataframe

# Find the sum of each columns in the new dataframe

# Find the sum of each  rows in the new dataframe

# Square each item of the new dataframe

# Square any one column of the new dataframe

# Import US Crime Rate data

In [ ]:
url = "https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/04_Apply/US_Crime_Rates/US_Crime_Rates_1960_2014.csv"
crime = pd.read_csv(url)
crime.head()

# Convert the type of the column Year to datetime64

# Set the Year column as the index of the dataframe

# Import the cars dataset

In [ ]:
cars1 = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv")
cars2 = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv")

In [ ]:
cars1.head()

In [ ]:
cars2.head()

# Fix car 1 dataset

#  What is the number of observations in each dataset?

# Join cars1 and cars2 into a single DataFrame called cars

# Create a new column with random number Series from 15,000 to 73,000.

# Create new dataframes

In [ ]:
raw_data_1 = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 
        'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}

raw_data_2 = {
        'subject_id': ['4', '5', '6', '7', '8'],
        'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
        'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}

raw_data_3 = {
        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}

In [ ]:
data1 = pd.DataFrame(raw_data_1, columns = ['subject_id', 'first_name', 'last_name'])
data2 = pd.DataFrame(raw_data_2, columns = ['subject_id', 'first_name', 'last_name'])
data3 = pd.DataFrame(raw_data_3, columns = ['subject_id','test_id'])

In [ ]:
data1

In [ ]:
data2

In [ ]:
data3

# Join the two dataframes along rows and assign all_data

# Join the two dataframes along columns and assing to all_data_col

# Merge all_data and data3 along the subject_id value

#  Merge only the data that has the same 'subject_id' on both data1 and data2

# Merge all values in data1 and data2, with matching records from both sides where available.

# Import the US baby name data

In [101]:
baby_names = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')

In [102]:
baby_names.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

 # Delete the column 'Unnamed: 0' and 'Id'

 # Is there more male or female names in the dataset?

# Print 5 top names

# How many different names exist in the dataset?

# How many different names have the least occurrences

# Load the chipotle dataset again

In [109]:
address = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv'
chipotle = pd.read_csv(address, sep="\t")
chipotle.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

# Create a barchart of the top 5 items bought

In [110]:
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

# Create a scatterplot to show the relationship between item price and item ordered

# Load the purchase data

In [116]:
online_rt = pd.read_excel("Online Retail.xlsx")
online_rt.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

# Create a barchat with the 10 countries that have the most 'Quantity' ordered except UK

# Load the apple dataset

In [118]:
url = 'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/09_Time_Series/Apple_Stock/appl_1980_2014.csv'
apple = pd.read_csv(url)

apple.head()

         Date   Open   High    Low  Close    Volume  Adj Close
0  2014-07-08  96.27  96.80  93.92  95.35  65130000      95.35
1  2014-07-07  94.14  95.99  94.10  95.97  56305400      95.97
2  2014-07-03  93.67  94.10  93.20  94.03  22891800      94.03
3  2014-07-02  93.87  94.06  93.09  93.48  28420900      93.48
4  2014-07-01  93.52  94.07  93.13  93.52  38170200      93.52

# Check out the type of the columns

# Transform the Date column as a datetime type

#  Set the date as the index

# Is there any duplicate dates?

# Make the first entry the oldest date.

# Get the last business day of each month

# Plot the 'Adj Close' value. Set the size of the figure to 13.5 x 9 inches

# Get Financial data from yahoo finance

In [126]:
from pandas_datareader import data
import fix_yahoo_finance as yf
yf.pdr_override() 
import datetime as dt

# Create your time range (start and end variables). The start date should be 01/01/2015 and the end should today (whatever your today is)

In [127]:
start = dt.datetime(2015, 1, 1)
end = dt.datetime.today()
start

datetime.datetime(2015, 1, 1, 0, 0)

# Select the Apple, Tesla, Twitter, IBM, LinkedIn stocks symbols and assign them to a variable called stocks¶

In [128]:
stocks = ['AAPL', 'TSLA', 'IBM', 'AMZN']

# Read the data from google, assign to df and print it

In [129]:
df = data.get_data_yahoo(stocks, start, end)
df

[*********************100%***********************]  4 of 4 downloaded

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 792 (major_axis) x 4 (minor_axis)
Items axis: Open to Volume
Major_axis axis: 2015-01-02 00:00:00 to 2018-02-23 00:00:00
Minor_axis axis: AAPL to TSLA

In [130]:
df.items

Index(['Open', 'High', 'Low', 'Close', 'Adj Close', 'Volume'], dtype='object')

In [131]:
vol = df['Adj Close']
vol.head()

                  AAPL        AMZN         IBM        TSLA
Date
2015-01-02  103.074181  308.519989  144.111176  219.309998
2015-01-05  100.170410  302.190002  141.843567  210.089996
2015-01-06  100.179840  295.290009  138.784607  211.279999
2015-01-07  101.584595  298.420013  137.877548  210.949997
2015-01-08  105.487686  300.459991  140.874329  210.619995